In [1]:
import numpy as np
import pandas as pd

In [2]:
data = {
    "Company": ["GOOG", "GOOG", "MSFT", "MSFT", "FB", "FB"],
    "Person": ["Sam", "Charlie", "Amy", "Venessa", "Carl", "Sarah"],
    "Sales": [200, 120, 340, 124, 243, 350]
}

In [4]:
df = pd.DataFrame(data)

# groupby

In [5]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Venessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [8]:
by_company = df.groupby("Company")

In [9]:
by_company.sum()

         Sales
Company
FB         593
GOOG       320
MSFT       464

In [13]:
by_company.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [14]:
by_company.std()

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

# 1行で書く

In [15]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Venessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [12]:
df.groupby("Company").sum().loc["FB"]

Sales    593
Name: FB, dtype: int64